=============|||
Basic Conjlist
=============|||

op ==
    /\ 1
    /\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item (land) (number))
      (conj_item (land) (number))
    )
  )
)

=============|||
Inline Conjlist
=============|||

op == /\ 1
      /\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item (land) (number))
      (conj_item (land) (number))
    )
  )
)

=============|||
Start-of-Line Conjlist
=============|||

op ==
/\ 1
/\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item (land) (number))
      (conj_item (land) (number))
    )
  )
)

=============|||
Left-Shifted Conjlist
=============|||

op ==
 /\ 1
/\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (infix_op
      (conj_list (conj_item (land) (number)))
      (land)
      (number)
    )
  )
)

=============|||
Right-Shifted Conjlist
=============|||

op ==
/\ 1
 /\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item
        (land)
        (infix_op
          (number)
          (land)
          (number)
        )
      )
    )
  )
)

=============|||
Separated Conjlist
=============|||

op ==
  /\ 1

  /\ 2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item (land) (number))
      (conj_item (land) (number))
    )
  )
)

=============|||
Multiline Conjlist
=============|||

op ==
  /\ 
   1
  /\
   2

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item (land) (number))
      (conj_item (land) (number))
    )
  )
)

=============|||
Nested Conjlist
=============|||

op ==
 /\ /\ 1
    /\ 2
 /\ 3

-------------|||

(source_file
  (unit
    (identifier)
    (conj_list
      (conj_item
        (land)
        (conj_list
          (conj_item (land) (number))
          (conj_item (land) (number))
        )
      )
      (conj_item (land) (number))
    )
  )
)
